XML/Dvd-Rental-SOAP

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loc="localhost:8080">
   <soapenv:Header/>
   <soapenv:Body>
      <loc:Rent>
         <!--Optional:-->
         <customer>
            <!--Optional:-->
            <customerAddress>
               <!--Optional:-->
               <address/>
               <!--Optional:-->
               <address2/>
               <!--Optional:-->
               <addressId/>
               <!--Optional:-->
               <cityId/>
               <!--Optional:-->
               <district/>
               <!--Optional:-->
               <lastUpdate/>
               <!--Optional:-->
               <phone/>
               <!--Optional:-->
               <postalCode/>
            </customerAddress>
            <!--Optional:-->
            <email/>
            <!--Optional:-->
            <firstName/>
            <!--Optional:-->
            <isActive/>
            <!--Optional:-->
            <lastName/>
         </customer>
         <!--Optional:-->
         <film>
            <!--Optional:-->
            <description/>
            <!--Optional:-->
            <filmId/>
            <!--Optional:-->
            <fulltext/>
            <!--Optional:-->
            <languageId/>
            <!--Optional:-->
            <lastUpdate/>
            <!--Optional:-->
            <length/>
            <!--Optional:-->
            <originalLanguageId/>
            <!--Optional:-->
            <rating/>
            <!--Optional:-->
            <releaseYear/>
            <!--Optional:-->
            <rentalDuration/>
            <!--Optional:-->
            <rentalRate/>
            <!--Optional:-->
            <replacementCost/>
            <!--Zero or more repetitions:-->
            <specialFeatures/>
            <!--Optional:-->
            <title/>
         </film>
         <!--Optional:-->
         <store>
            <!--Optional:-->
            <staff>
               <!--Optional:-->
               <active/>
               <!--Optional:-->
               <addressId/>
               <!--Optional:-->
               <address_id/>
               <!--Optional:-->
               <email/>
               <!--Optional:-->
               <firstName/>
               <!--Optional:-->
               <lastName/>
               <!--Optional:-->
               <lastUpdate/>
               <!--Optional:-->
               <password/>
               <!--Zero or more repetitions:-->
               <picture/>
               <!--Optional:-->
               <staffId/>
               <!--Optional:-->
               <username/>
            </staff>
            <!--Optional:-->
            <storeAddress>
               <!--Optional:-->
               <address/>
               <!--Optional:-->
               <address2/>
               <!--Optional:-->
               <addressId/>
               <!--Optional:-->
               <cityId/>
               <!--Optional:-->
               <district/>
               <!--Optional:-->
               <lastUpdate/>
               <!--Optional:-->
               <phone/>
               <!--Optional:-->
               <postalCode/>
            </storeAddress>
         </store>
      </loc:Rent>
   </soapenv:Body>
</soapenv:Envelope>